# SegmentLengthRoundingMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarRoundingManager..::..SegmentLengthRoundingMethod Property
RebarRoundingManager Class See Also
---
Identifies the segment length rounding method
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RoundingMethod SegmentLengthRoundingMethod { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthRoundingMethod As RoundingMethod
	Get
	Set
```

Visual C++
---
```text
public:
property RoundingMethod SegmentLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: IsActiveOnElement property is false. |

# See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace